<?
$text="λαλά";
$greekfind = array("αι", "οι", "ου", "ει", "ευ", "αυ","Α", "Β", "Γ", "Δ", "Ε", "Ζ", "Η", "Θ", "Ι", "Κ", "Λ", "Μ", "Ν", "Ξ", "Ο", "Π", "Ρ", "Σ", "Τ", "Υ", "Φ", "Χ", "Ψ", "Ω","α", "β", "γ", "δ", "ε", "ζ", "η", "θ","ι", "κ", "λ", "μ", "ν", "ξ", "ο", "π", "ρ", "σ", "τ", "υ", "φ", "χ", "ψ", "ω","Ά", "ά", "Έ", "έ", "Ή", "ή", "Ί", "ί", "Ό", "ό", "Ύ", "ύ", "Ώ", "ώ", "ΐ", "ΰ", "ϊ", "ϋ", "ς");
$greekreplace = array ("ai", "oi", "ou", "ei", "ef", "af","A", "V", "G", "D", "E", "Z", "I", "Th", "I", "K", "L", "M", "N", "X", "O", "P", "R","S","T","I","F","H", "Ps", "W","a", "v", "g", "d", "e", "z", "i", "th", "i", "k", "l","m","n","x","o","p","r","s","t","i","f","h","ps","w","a","a","e","e","i","i", "i", "i", "o", "o", "i", "i", "w", "w", "i", "i", "i", "i", "s");
$greeklish = str_replace ($greekfind, $greekreplace, $text);
echo $greeklish;
?>
